In [2]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [3]:
url = 'https://www.boxofficemojo.com/title/tt15398776/'#To scrap the barbie table use "https://www.boxofficemojo.com/title/tt1517268/" as the url
response = requests.get(url)

In [4]:
soup = BeautifulSoup(response.text, 'html.parser')

In [5]:
table = soup.find_all('table',class_='a-bordered a-horizontal-stripes a-size-base-plus')
table1=soup.find_all('table',class_='a-bordered a-horizontal-stripes a-size-base-plus')[0]

In [6]:
headers = [] #create the headers for the Dataframe using the html tag <th>
for i in table1.find_all("th"):
 title = i.text.strip()
 headers.append(title)

In [7]:
dt = pd.DataFrame(columns = headers)

In [10]:
def scrap_tables(table1):  #Using the tags <tr> and <td> we locate the data and create the rows of our dataframe
    for i in table1.find_all("tr")[1:]:
     row_data = i.find_all("td")
     row = [j.text for j in row_data]
     length = len(dt)
     dt.loc[length] = row

In [11]:
for tab in table: #The web contains multiple tables, we iterate every single one 
    scrap_tables(tab)

In [12]:
dt

              Area  Release Date      Opening         Gross
0         Domestic  Jul 21, 2023  $82,455,420  $245,469,475
1   United Kingdom  Jul 21, 2023  $13,914,966   $49,912,723
2          Germany  Jul 20, 2023   $6,646,885   $28,593,012
3           France  Jul 19, 2023   $6,933,935   $24,402,152
4            Spain  Jul 21, 2023   $3,075,484   $13,413,635
..             ...           ...          ...           ...
65        Malaysia  Jul 20, 2023     $833,740    $2,156,555
66        Pakistan  Jul 21, 2023     $202,754      $490,559
67       Sri Lanka  Jul 21, 2023      $50,683      $153,313
68      Bangladesh  Jul 21, 2023      $40,859      $124,936
69        Mongolia  Jul 21, 2023      $33,454      $113,891

[70 rows x 4 columns]

In [13]:
dt.to_excel("Oppenheimer_box_ofice.xlsx") #Transform the data in an excel spreadsheet